
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 12 to change, 19 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.send-letter-service-exception-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.send-letter-service-liveness-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.send-letter-service-pending-letter-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.send-letter-service-stale-letter-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.send-letter-up-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * module.db-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.db-v11.azurerm_resource_group.data-resourcegroup
  * module.db-v11.azurerm_template_deployment.postgres-paas
  * module.db-v11.null_resource.subnet_mappings[0]
  * module.db-v11.null_resource.subnet_mappings[1]
  * module.db-v11.null_resource.subnet_mappings[2]
  * module.db-v11.null_resource.subnet_mappings[3]
  * module.db-v11.null_resource.subnet_mappings[4]
  * module.db-v11.null_resource.subnet_mappings[5]
  * module.db-v11.null_resource.subnet_mappings[6]
  * module.db-v11.null_resource.subnet_mappings[7]
  * module.db-v11.null_resource.subnet_mappings[8]
  * module.db-v11.null_resource.subnet_mappings[9]
  * module.db-v11.random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-PASS/36f3300c447842ff9b13142dd4f1d5e2" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod" -> null
      - name                    = "send-letter-service-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-PASS/versions/36f3300c447842ff9b13142dd4f1d5e2" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "36f3300c447842ff9b13142dd4f1d5e2" -> null
      - versionless_id          = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-USER/160ea960315c44118d03beb121245567" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod" -> null
      - name                    = "send-letter-service-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-USER/versions/160ea960315c44118d03beb121245567" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "160ea960315c44118d03beb121245567" -> null
      - versionless_id          = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-DATABASE/c0e0472b8347456385cbbd5eb5820f8a" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod" -> null
      - name                    = "send-letter-service-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-DATABASE/versions/c0e0472b8347456385cbbd5eb5820f8a" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "c0e0472b8347456385cbbd5eb5820f8a" -> null
      - versionless_id          = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-HOST/1ff7f09b97b14c07a55cf33d127eb10d" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod" -> null
      - name                    = "send-letter-service-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-HOST/versions/1ff7f09b97b14c07a55cf33d127eb10d" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "1ff7f09b97b14c07a55cf33d127eb10d" -> null
      - versionless_id          = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-PORT/5880c6a630fb46418d375adc82b14788" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod" -> null
      - name                    = "send-letter-service-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-PORT/versions/5880c6a630fb46418d375adc82b14788" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod/secrets/send-letter-service-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5880c6a630fb46418d375adc82b14788" -> null
      - versionless_id          = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/app-insights-connection-string/9724d53525a9404f858e702b72b41da4"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-28T08:23:50Z" -> (known after apply)
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-DATABASE/432aeac2ff584112a7a991d454b2d58c"
        name                    = "send-letter-service-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-28T08:23:50Z" -> (known after apply)
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-HOST/44ff67f6bd874a37911b4742d005b34a"
        name                    = "send-letter-service-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-28T08:23:50Z" -> (known after apply)
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PASS/2e3bdf6a4b4046df9303e4c8325d3fd7"
        name                    = "send-letter-service-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-28T08:23:50Z" -> (known after apply)
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PORT/a14368c5a6d54773a839ad69b745b781"
        name                    = "send-letter-service-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-28T08:23:50Z" -> (known after apply)
        id                      = "https://rpe-send-letter-prod.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-USER/a0126322a3394dd09dee298bcad1257b"
        name                    = "send-letter-service-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod"
      + name                    = "send-letter-service-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Software Engineering"
          + "source"              = "send-letter-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod"
      + name                    = "send-letter-service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Software Engineering"
          + "source"              = "send-letter-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod"
      + name                    = "send-letter-service-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Software Engineering"
          + "source"              = "send-letter-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod"
      + name                    = "send-letter-service-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Software Engineering"
          + "source"              = "send-letter-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.KeyVault/vaults/rpe-send-letter-prod"
      + name                    = "send-letter-service-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Software Engineering"
          + "source"              = "send-letter-service PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/BSP_Alert"
        name                = "BSP_Alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.db-v11.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/send-letter-service-db-data-prod/providers/Microsoft.DBforPostgreSQL/servers/send-letter-service-db-prod" -> null
      - login               = "DTS Platform Operations SC" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - resource_group_name = "send-letter-service-db-data-prod" -> null
      - server_name         = "send-letter-service-db-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.db-v11.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/send-letter-service-db-data-prod" -> null
      - location = "uksouth" -> null
      - name     = "send-letter-service-db-data-prod" -> null
      - tags     = {
          - "application"         = "core"
          - "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "production"
          - "managedBy"           = "Software Engineering"
        } -> null
    }

  # module.db-v11.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/send-letter-service-db-data-prod/providers/Microsoft.Resources/deployments/send-letter-service-db-prod" -> null
      - name                = "send-letter-service-db-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "send_letter"
          - "administratorLoginPassword" = ":D0lpVX0mMtLUPj{"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc2VuZC1sZXR0ZXItc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3BsYXRvcHMtaGVscCIsImVudmlyb25tZW50IjoicHJvZHVjdGlvbiIsIm1hbmFnZWRCeSI6IlNvZnR3YXJlIEVuZ2luZWVyaW5nIn0="
          - "dbName"                     = "send_letter"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "send-letter-service-db-prod"
          - "skuCapacity"                = "4"
          - "skuName"                    = "GP_Gen5_4"
          - "skuSizeMB"                  = "102400"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "send-letter-service-db-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.db-v11.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1437238658629095830" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5458300893544409333" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6058284021859919508" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3112347860337642425" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3874832218624343431" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4019069734759227694" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4217784072999886557" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5260402555852879651" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1644902672720411017" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.db-v11.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2752437400393897494" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.db-v11.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = ":D0lpVX0mMtLUPj{" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = ":D0lpVX0mMtLUPj{" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.send-letter-service-exception-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/Send_Letter_Service_exception_-_BSP"
        name                = "Send_Letter_Service_exception_-_BSP"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-service-liveness-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/Send_Letter_Service_liveness_-_BSP"
        name                = "Send_Letter_Service_liveness_-_BSP"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-service-pending-letter-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/Send_Letter_Service_Pending_Letter_-_BSP"
        name                = "Send_Letter_Service_Pending_Letter_-_BSP"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-service-stale-letter-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/Send_Letter_Service_Stale_Letter_-_BSP"
        name                = "Send_Letter_Service_Stale_Letter_-_BSP"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-up-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Resources/deployments/Send_Letter_is_DOWN_-_BSP"
        name                = "Send_Letter_is_DOWN_-_BSP"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 12 to change, 19 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-send-letter-service-prod/providers/Microsoft.Insights/components/rpe-send-letter-service-appinsights-prod"
        name                                  = "rpe-send-letter-service-appinsights-prod"
        tags                                  = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "production"
            "managedBy"           = "Software Engineering"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":2516,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->